## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:33" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:33" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 33 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "eae6e9031bd39a0c2adceca7cf999cad-5" -> "04a1fc0c62a2d3a73d69887cbac0b8cb"
        id                     = "cpfValidation.04a1fc0c62a2d3a73d69887cbac0b8cb.zip"
        tags                   = {}
      ~ version_id             = "rAZAj.X2q9hL0CrlqvgIbdg_Jaxxa_wx" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "41ce91252ab8d3546fb5905ff561b7c4-6" -> "20739793d622992f3eae2ba77a6afbb0"
        id                     = "excelToJson.20739793d622992f3eae2ba77a6afbb0.zip"
        tags                   = {}
      ~ version_id             = "ranmRZNEHmXUokETQ_RD7uNEaXg45lEw" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "4d9b7d28d657997f080fe7e419364fa7-6" -> "8b5829391343440b34a2fc994a862af7"
        id                     = "graphql.8b5829391343440b34a2fc994a862af7.zip"
        tags                   = {}
      ~ version_id             = "i1OyWR3UScbS_xK8kjSx1E_mOyMQyuB0" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "55017d31a2abe6041fa411d989c61d55" -> "91456f4cb362c626386f1400711e3cdd"
        id                     = "dist/200.html"
      ~ source_hash            = "55017d31a2abe6041fa411d989c61d55" -> "91456f4cb362c626386f1400711e3cdd"
        tags                   = {}
      ~ version_id             = "8n.VPTUK4Ia2ti.K3SqGDh.MHCmWF7Ij" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "94bb3362f118fa5c2e22df54d2353b82" -> "42880730daa9f97c571a9a0d70be85e5"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "94bb3362f118fa5c2e22df54d2353b82" -> "42880730daa9f97c571a9a0d70be85e5"
        tags                   = {}
      ~ version_id             = "fOOUb9.9rRV.oVPMV6IrIDq8maSK1dRa" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "43af03dca34c5e16ca835bdec270baaa" -> "d10c94a106f9a628f89143d8a6f9d267"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "43af03dca34c5e16ca835bdec270baaa" -> "d10c94a106f9a628f89143d8a6f9d267"
        tags                   = {}
      ~ version_id             = "VeoHBGwDR4kTHMdhxqyFXBrHqf.ngvqf" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "55017d31a2abe6041fa411d989c61d55" -> "91456f4cb362c626386f1400711e3cdd"
        id                     = "dist/index.html"
      ~ source_hash            = "55017d31a2abe6041fa411d989c61d55" -> "91456f4cb362c626386f1400711e3cdd"
        tags                   = {}
      ~ version_id             = "J6KR9PWEeK_Ot5wLnsayib1uM4UGxN0Q" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.859fd373.js"] will be destroyed
  # (because key ["static/js/app.859fd373.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "74816678d128b3a2f46567ec22670edf" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.859fd373.js" -> null
-       key                    = "dist/static/js/app.859fd373.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.859fd373.js" -> null
-       source_hash            = "74816678d128b3a2f46567ec22670edf" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "_ZQ.HBxMkWFTvaGnaTlRg4Ow6jLe2Ucq" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.859fd373.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.859fd373.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9ca7566c06c8f1334eac82d09ba421ad" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.859fd373.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.859fd373.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.859fd373.js.LICENSE.txt" -> null
-       source_hash            = "9ca7566c06c8f1334eac82d09ba421ad" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Z58n7lgbpjFITLMJ6sRnVGNU9z71QWtG" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.e241c189.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "5afa87c439b4fd24b632ede81f6b0a00"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.e241c189.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.e241c189.js"
+       source_hash            = "5afa87c439b4fd24b632ede81f6b0a00"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.e241c189.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9ca7566c06c8f1334eac82d09ba421ad"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.e241c189.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.e241c189.js.LICENSE.txt"
+       source_hash            = "9ca7566c06c8f1334eac82d09ba421ad"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be updated in-place
  ~ resource "aws_apigatewayv2_api" "this" {
        id                           = "kxob8wkmkf"
        name                         = "cpfreporter"
        tags                         = {}
        # (9 unchanged attributes hidden)

      ~ cors_configuration {
          ~ allow_headers     = [
+               "auth-provider",
                # (11 unchanged elements hidden)
            ]
            # (5 unchanged attributes hidden)
        }
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:2/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "ed25925e4f702f695d2cd86833902971999c5706" -> "1973ffa88ac134245d94341e2a998a8dc91f7a45"
              ~ "DD_TAGS"                      = "git.commit.sha:ed25925e4f702f695d2cd86833902971999c5706,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:1973ffa88ac134245d94341e2a998a8dc91f7a45,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "ed25925e4f702f695d2cd86833902971999c5706" -> "1973ffa88ac134245d94341e2a998a8dc91f7a45"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:2/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "ed25925e4f702f695d2cd86833902971999c5706" -> "1973ffa88ac134245d94341e2a998a8dc91f7a45"
              ~ "DD_TAGS"                      = "git.commit.sha:ed25925e4f702f695d2cd86833902971999c5706,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:1973ffa88ac134245d94341e2a998a8dc91f7a45,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "ed25925e4f702f695d2cd86833902971999c5706" -> "1973ffa88ac134245d94341e2a998a8dc91f7a45"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:49" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:49/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "49" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "ed25925e4f702f695d2cd86833902971999c5706" -> "1973ffa88ac134245d94341e2a998a8dc91f7a45"
              ~ "DD_TAGS"                            = "git.commit.sha:ed25925e4f702f695d2cd86833902971999c5706,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:1973ffa88ac134245d94341e2a998a8dc91f7a45,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "ed25925e4f702f695d2cd86833902971999c5706" -> "1973ffa88ac134245d94341e2a998a8dc91f7a45"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "49" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 12 to change, 6 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7493282945)*